# Pandas가 무엇인가요?
* 팬더스 데이터 프레임, 시리즈 알아보기

In [1]:
import pandas as pd

In [3]:
data_frame = pd.read_csv('data/housing.csv')

* tab을 누르면 사용할 수 있는 자동완성 리스트가 나온다.
* data_frame 은 2D array이다 excel과 상당히 유사
* pandas는 기본적으로 numpy를 사용한다. 퍼모먼스가 좋다.

In [6]:
data_frame.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

* data_frame의 각 컬럼들이 Series 이다.
* 그래서 data_frame은 Series의 결합체이다.

In [7]:
list_tmp = [1,2,3]

In [8]:
list_tmp

[1, 2, 3]

In [9]:
s1 = pd.core.series.Series([1,2,3])

In [10]:
s2 = pd.core.series.Series(['one','two','three'])

In [12]:
# series 2개로 데이터 프레임 만들기
pd.DataFrame(data=dict(num=s1,word=s2)) 
# 숫자는 s1, word는 s2
# python 리스트로 시리즈 만들고
# series로 데이터프레임을 만들었다.
# 이건 라이브러리 안에서 실행된다.

   num   word
0    1    one
1    2    two
2    3  three

In [19]:
data_frame.tail(2) #뒤에서 두개

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [ ]:
df = pd.read_csv('data/tab.csv',delimiter = '\t')
# 데이터가 탭으로 구분된 경우

In [ ]:
df = pd.read_csv('data/tab.csv',header = None)
# 데이터에 헤더가 없어요~

In [ ]:
df.columns = ['name','age','job']
# 헤더 정보를 넣어주기.

In [ ]:
df =pd.read_csv('data/no_header.csv', header= None , names =['name','age','job'])
# 한방에 넣을 수 있다.

# Create DataFrame from your python code

In [20]:
import pandas as pd

In [21]:
# dictionary를 가지고 있는 리스트 만들것이다.
friend_dict_list = [
    {'name':'John','age':25, 'job':'student'},
    {'name':'Nate','age':30, 'job':'teacher'}
]

In [22]:
df = pd.DataFrame(friend_dict_list)

In [23]:
df.head()
# 딕셔너리는 키값의 순서가 보장이 안된다.

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [24]:
df = df[['name','age','job']]
# 컬럼의 순서를 변경해야하는 번거로움

In [25]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [26]:
from collections import OrderedDict

In [27]:
#키의 순서를 보장한다.
friend_ordered_dict = OrderedDict(
    [
        ('name',['john','nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
        
    ]
)

In [28]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [29]:
df.head()

   name  age      job
0  john   25  student
1  nate   30  teacher

In [30]:
friend_list = [
    ['john',20,'student'],
    ['Nate',30,'teacher']
]

In [31]:
column_name = ['name','age','job']

In [32]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [33]:
df.head()

   name  age      job
0  john   20  student
1  Nate   30  teacher

In [34]:
# 한번에 만들어 보고싶다!

In [35]:
friend_list =[
    ['name',['John','Nate']],
    ['age',[20,30]],
    ['job',['student','teacher']]
]

In [36]:
df = pd.DataFrame.from_items(friend_list)

In [37]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
# 이처럼 Dictionary와 list를 활용하면 DataFrame을 만들 수 있다.